[
    {
        "title": "Information We Collect",
        "description": "We may collect personal information, such as your name, email address, phone number, and other relevant details when you voluntarily provide it to us. Additionally, we may automatically collect certain information about your device and usage of our website through cookies and similar technologies."
    },
    {
        "title": "How We Use Your Information",
        "description": "We use the information we collect to provide, maintain, and improve our services, communicate with you, customize your experience, and fulfill your requests. We may also use your information for marketing and promotional purposes with a consent from you."
    },
    {
        "title": "Security of Your Information",
        "description": "At Diva, we take the security of your personal information seriously. We have implemented a range of robust security measures to safeguard your data and ensure its protection when you access it. From encryption protocols to secure server networks, we employ industry-standard security practices to maintain the confidentiality and integrity of your personal information. Our dedicated team regularly monitors and updates our security systems to stay ahead of potential threats and vulnerabilities."
    },
    {
        "title": "Confidentiality of Briefs",
        "description": "At Diva, we prioritize the confidentiality of your creative projects and the information you provide to us. When you submit a brief for any creative project, rest assured that your information is treated with the utmost confidentiality and is only accessible to authorized personnel within Diva. We do not share your briefs or any associated information with any third parties without your explicit consent. Your creative projects and the details contained within them are securely stored and used solely for the purpose of fulfilling your requests and delivering exceptional creative solutions."
    },
    {
        "title": "Presentation & Revisions",
        "description": " W​e will create a Mood-board, which will feature a couple of main logo ideas, inspirational images, textures and fonts that will embody your branding identity. We’ll ask you to gather feedback on them to later join us for a call in which we’ll go through your feedback together, apply live changes and perfect your logo of choice."
    },
    {
        "title": "Your Choices and Rights",
        "description": "You have the right to access, correct, or delete your personal information and opt-out of certain communications. You can update your preferences or unsubscribe from our marketing emails at any time by contacting us."
    },
    {
        "title": "Updates to This Privacy Policy",
        "description": "We may update this Privacy Policy from time to time to reflect changes in our practices or legal requirements. We encourage you to review this Privacy Policy periodically for any updates."
    }
]
