[
    {
        "text": "Glamourique Spa had the pleasure of collaborating with Diva for our brand identity and strategy, and we couldn't be more thrilled with the results. Diva's expertise in crafting luxurious and sophisticated brand identities perfectly complemented our vision for the spa. I want to extend our heartfelt thanks to every member of their team, especially Dina, for their dedication and commitment to excellence.",
        "author": "Glamourique Spa",
        "title": "Based in United Arab Emirates"
    },
    {
        "text": "Collaborating with Diva was an absolute delight! Their creative prowess and attention to detail elevated our social media designs to new heights of sophistication. Not only were they incredibly creative and visually stunning, but they also perfectly captured the essence of our brand. We highly recommend Diva to anyone seeking creative excellence and a touch of luxury in their design work!",
        "author": "Sajda Jewelry",
        "title": "Based in Saudi Arabia"
    },
    {
        "text": "شكرا شكرا ديفا على إنشاء الويبسايت اللي دائما احلم فيه من يوم ما بديت شغل! التعامل اكثر من رائع التيم جدا متعاون و ما قصروا في أي مرحلة، ملوك التميز و العناية بالتفاصيل، الموقع يعبر عني و عن افكاري بالظبط. فرحتي لا توصف بالنتيجة، وأنصح بشدة بخدمات ديفا لكل من يبحث عن لمسة من الفخامة والأناقة.",
        "author": "alanoud Al-Etabi",
        "title": "Based in Saudi Arabia"
    },
    {
        "text": "You have done an exceptional job working on the interface of the company and how it is presented through its logos and banners, and through your creative work of art you have added a great deal to our game projects and the interactive experiences with the UI, on top of that helped make our released videos and tutorials have great presentation through their banner designs.",
        "author": "Forsaken Quest",
        "title": "Based in London, UK"
    }
    ,
    {
        "text": "شكرا بجد لدينا على وجه الخصوص على شغلها الجميل ده وحقيقي يعني انتي شخص حلو اوي وبيهتم جدا بالتفاصيل الصغيره اللي فعلا بتفرق في الشغل وبتبينه. يعني نفذتي فعلا اللي كان في دماغي واللي انا كنت عايزه اعمله من ناحيه اللوجو وكل حاجه طلعت زي ما انا عايزاها بالظبط و  احسن كمان كتييير. موهبه حقيقية مبنية علي علم و اساس قوي،شغلكم فوق الممتاز عندكم تناسق للالوان رهيب وابداع غير عادي في صياغة ال brand story وكمان بتقدري انك تخلصي شغلك بسرعه قبل الديدلاين و دي حاجه حلوه اوي. فرحت جدا بالتعامل معاكم وان شاء الله مش اخر مره",
        "author": "Little Kingdom Day Care",
        "title": "Based in Cairo, Egypt"
    },
    {
        "text": "You have done an exceptional job working on the interface of the company and how it is presented through its logos and banners, and through your creative work of art you have added a great deal to our game projects and the interactive experiences with the UI, on top of that helped make our released videos and tutorials have great presentation through their banner designs.",
        "author": "Forsaken Quest",
        "title": "Based in London, UK"
    }
]